'use strict'
// 1行目に記載している 'use strict' は削除しないでください


kugiri("worming up1"); //---------------------------------------------


kugiri("worming up2"); //---------------------------------------------



kugiri("kiso1"); //---------------------------------------------



kugiri("chukyu1"); //---------------------------------------------



kugiri("oyo1"); //---------------------------------------------
//randomStopLight という名前の関数を宣言してください。
//この関数が呼び出されたら 0 以上 10 以下のランダムな整数を生成します。
//生成された数字が 3 未満であれば "🔴Red" を、3 以上 6 以下であれば
// "🟡Yellow" を、6 より大きければ "🟢Green"を返すようにしてください。
//アドバイス： Math.random を使ってみましょう。
/*
 緑：&#x1F7E2;<br>
  黄：&#x1F7E1;<br>
  赤：&#x1F534;
*/
console.log("\&#x1F534;", "🟢",  Math.floor(Math.random() * 11));

//switch

